const re1 = /^\d{2}\.\d{2}\.\d{4}$/;
const re2 = /^(0?[1-9]|1\d|2\d|3[01])\.(0?[1-9]|1[012])\.(20\d{2})$/;

console.log(re2.test("27.06.2026"));
console.log(re2.test("07.06.2026"));
console.log(re2.test("05-03-2026"));
console.log(re2.test("00.99.20266"))

const FRC5322 = /(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|"(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])*")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\[(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?|[a-z0-9-]*[a-z0-9]:(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)\])/;

const re3 = /^\w+@\w{2,}\.\w{2,10}$/;

console.log(re3.test("some@gmail.com"));
console.log(re3.test("some-fio@mail.ru"));
console.log(re3.test("test.test.test@mail.ru"));
console.log(re3.test("milo5@mail.ru"));
console.log(re3.test("test@test@mail.ru"));

console.log('Ехал Грека'.replace(/ре/gi, 'ле'));
console.log('Ехал Грека'.replace(/([а-яё]+) ([а-яё]+)/gi, '$2 $1')); 

const re4 = /(\d{4})\.(\d?\d)\.(\d?\d)/;
console.log("2022.12.23".replace(re8, '$3-$2-$1')); //23-12-2022
console.log("2022.5.7".replace(re8, '$3-$2-$1')); //7-5-2022
console.log("2022.1.31".replace(re8, '$3-$2-$1')); //31-1-2022

/*

! Пояснения символов в регулярных выражениях

[a-z] - один из символов от a до z
[0-9] - один из символов от 0 до 9
[2348] - один из символов 2, 3, 4, 8
. - любой символ кроме пробельного
\. - именно символ точки
\w - [0-9a-z_] - один из символов от 0-9, или a-z, или подчеркивание
\d - тоже самое, что [0-9]
а{4} - четыре символа а
() - групировка
(ма){2} - слово "мама"
ма{2} - слово "маа"
(4|5) - только один из вариантов - 4 или 5
(ма|па) - только один из вариантов - ма или па
q{5} - слово qqqqq
q{2,} - слово из двух или более букв q
q{2,5} - слово из двух, трех, четырех, или пяти букв q
q{,5} - слово не более чем из пяти букв q
q{0,1} - или есть буква q или нету
q? - или есть буква q или нету
q+ - это тоже самое что q{1,}
q* - это тоже самое что q{0,}
\s - пробельный символ
^ в начале RegExp - это привязка к началу строки
$ в конце RegExp - это привязка к концу строки

*/
